---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraint.GetConstraintType
source: html/5c90f541-5fa5-946b-4b4f-4126a29650f2.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.GetConstraintType Method

Returns the RebarConstraintType of a RebarConstraint.

## Syntax (C#)
```csharp
public RebarConstraintType GetConstraintType()
```

## Returns
The RebarConstraintType of the specified RebarConstraint.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - RebarConstraint is no longer valid.